DataProcessors/МЛК_Оплаты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>МЛК_Оплаты</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлатежныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПоступлениеНаСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РеестрОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Пакет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОплатаКУ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоступлениеНаСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/МЛК_РеестрОплат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МЛК_РеестрОплат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платежка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеНаРасчетныйСчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пакет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаЗагрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИД_События</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокОплатыБит</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.бит_ОплатаКУ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОперацияПоПлатежнойКарте</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОплатаПлатежнойКартой</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/бит_ПроживающиеПоЛС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_ПроживающиеПоЛС</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусФизЛица</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтепеньРодства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтепениРодстваФизЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусПроживания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_СтатусПроживания</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаСнятияСРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаЗаписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВладелецКвартиры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДаНет</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаВыписки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПричинаПрописки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПричиныВыписки</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КудаВыписан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОткудаПрибыл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоляПлощади</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПравоустанавливающиеДокументы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПравоустанавливающиеДокументы</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусФизЛицаДляИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусФизЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПрибытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДоляПлощадиСтрокой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_СтрокаРодствДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ИгнорироватьПериодВКопииФЛС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаРегистрацииДляФЛС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>лб_ДатаВыпискиДляФЛС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ПомещенВАрхив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПраваСобственности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>бит_ВПечать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Проживающие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/бит_НачисленияПоУслугамЖКХ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>бит_НачисленияПоУслугамЖКХ</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>16</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>лб_ВидРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаЖКХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/МЛК_Комиссия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>МЛК_Комиссия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КомиссияСверху</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КомиссияВСумме</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/бит_ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ТипыКонтактнойИнформации</Name>
			<Comment>БИТ</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/МЛК_Оплаты/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Функция ОбновитьПараметрыЖКХ(Дата)
	
	ПараметрыЖКХ = Новый Структура;
	ПараметрыЖКХ.Вставить("РасчетСУчетомДолейВладения"                           , Ложь);
	ПараметрыЖКХ.Вставить("УменьшениеНормыЛьготыВПределахФакта"                  , Ложь);
	ПараметрыЖКХ.Вставить("ЛьготаПерсонифицированная"                            , Ложь);
	ПараметрыЖКХ.Вставить("НачислениеСУчетомДнейПроживания"                      , Ложь);
	ПараметрыЖКХ.Вставить("РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	ПараметрыЖКХ.Вставить("РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика", Ложь);
	
	ПараметрыЖКХ.Вставить("НачислятьПениСУчетомПереплаты", Ложь); 
	
	бит_ОбщегоНазначения.ПолучитьНастройкиЖКХ(КонецДня(Дата), Объект.Организация, ПараметрыЖКХ);
	
	Возврат ПараметрыЖКХ;
	
КонецФункции

&НаСервере
Процедура СоздатьОплатуКУНаСервере()
	// Сначала проверим Сколько пакетов
	
	КопияТЗ = Объект.РеестрОплат.Выгрузить();
	КопияТЗ.Свернуть("Пакет,Дата","Сумма");
	
	Для Каждого Стр Из КопияТЗ Цикл
		
		Документ = Документы.бит_ОплатаКУ.СоздатьДокумент();
		
		Дата = Стр.дата; //Дата пакета
		
		Если НЕ ЗначениеЗаполнено(Дата) Тогда
			
			Продолжить;
			
		КонецЕсли;
		
		Документ.Дата           = Дата;
		Документ.УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним);
		Документ.Организация    = Объект.Организация;
		Документ.Ответственный  = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("глТекущийПользователь");
		Документ.ИсточникОплаты = Объект.Контрагент;
		//Документ.ВводВРучную    = Объект.Вручную;
		//Документ.НомерРеестра   = Объект.НомерРеестра;
		Документ.Комментарий    = Строка(Стр.Пакет)+" "+"""МЛК ОПЛАТЫ"".";
		
		ИтогПоДокументу      = Стр.Сумма;
		СуммаИтогПоДокументу = 0;
		
		
		МассивЛС = Новый Массив;
		
		ПараметрыЖКХ = ОбновитьПараметрыЖКХ(Дата);
		
		ТЗОплатыПакета = ПолучитьТаблицуПакета(Стр.Пакет);
		
		Для каждого СтрокаВторогоУровня Из ТЗОплатыПакета Цикл
			Если ЗначениеЗаполнено(СтрокаВторогоУровня.Дата) И НЕ СтрокаВторогоУровня.Сумма = 0 Тогда
				
				НоваяСтрокаЛС = Документ.СписокЛС.Добавить();
				НоваяСтрокаЛС.ЛицевойСчет     = СтрокаВторогоУровня.ЛицевойСчет;
				НоваяСтрокаЛС.ШаблонИзвещений = Справочники.бит_ШаблоныИзвещений.ПоВсемУслугам;
				ИтогПоЛС      = СтрокаВторогоУровня.Сумма;
				СуммаИтогПоЛС = 0;
				НоваяСтрокаЛС.Сумма = СтрокаВторогоУровня.Сумма;
				
				тмпСписокЛС = НоваяСтрокаЛС.ВыгрузитьКолонку("ЛицевойСчет");
				Колонки  = НоваяСтрокаЛС.Колонки;
				
				УдалитКолоку = Колонки.Найти("Услуга");
				
				Колонки.Удалить(УдалитКолоку);
				
				бит_ОбщегоНазначения.ЗаполнениеСчетовКУ(НоваяСтрокаЛС, Колонки, тмпСписокЛС, Документ.Организация , Документ.Дата, Документ.ИсточникОплаты, Истина);
				
				
				ТаблицаЛС          = Документ.СписокЛС.Выгрузить();
				КоммунальныеУслуги = Документ.СписокУслуг.ВыгрузитьКолонки();
				
				бит_ОбщегоНазначения.РаспределениеСуммПоОплате(Дата,
				Объект.Организация,
				ТаблицаЛС,
				КоммунальныеУслуги,
				ПараметрыЖКХ.ЛьготаПерсонифицированная,
				ПараметрыЖКХ.РасчетСУчетомДолейВладения,
				ПараметрыЖКХ.УменьшениеНормыЛьготыВПределахФакта,
				ПараметрыЖКХ.НачислениеСУчетомДнейПроживания,
				ПараметрыЖКХ.РасчетПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
				ПараметрыЖКХ.РаспределениеПропорциональноФактуРасчетаПоСоциальнымНормамСУчетомМноготарифногоСчетчика,
				ПараметрыЖКХ.НачислятьПениСУчетомПереплаты); 
				
				Документ.СписокУслуг.Очистить();
				Документ.СписокУслуг.Загрузить(КоммунальныеУслуги);
				
				СуммаИтогПоДокументу = СуммаИтогПоДокументу + СтрокаВторогоУровня.Сумма;
				
			КонецЕсли; 
		КонецЦикла; 
		
		Документ.СуммаДокумента = СуммаИтогПоДокументу;
		
		Документ.ЗапролнитьСчета();
		
		Если бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(Документ, РежимЗаписиДокумента.Запись,,"Ошибки") Тогда
			
			////Тут создадим оплату по карте
			//ОплатаКартой = Документы.ОплатаПлатежнойКартой.СоздатьДокумент();
			//ОплатаКартой.Контрагент = Объект.Контрагент;
			//ОплатаКартой.Организация = Объект.Организация;
			//ОплатаКартой.ДоговорКонтрагента = ДоговорКонтрагента();
			//ОплатаКартой.Заполнить(Документ.Ссылка);
			//
			//Попытка
			//	ОплатаКартой.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			//Исключение
			//	ОплатаКартой.Записать(РежимЗаписиДокумента.Запись,РежимПроведенияДокумента.Неоперативный);
			//КонецПопытки;
			
			Сообщить("Создан документ: "+Строка(Документ.Ссылка));
			МенеджерЗаписи = РегистрыСведений.МЛК_РеестрОплат.СоздатьНаборЗаписей();
			МенеджерЗаписи.Отбор.пакет.Установить(Стр.Пакет);
			МенеджерЗаписи.Прочитать();
			
			Для каждого СтрНабор Из  МенеджерЗаписи Цикл
				//Изменить существующую запись
				СтрНабор.ДокОплатыБит = Документ.Ссылка;
			КонецЦикла;
			МенеджерЗаписи.Записать();			
			
			
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ДоговорКонтрагента()
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И ДоговорыКонтрагентов.Организация = &Организация";
	
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.Ссылка;	
	КонецЕсли;
	
	Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
КонецФункции

&НаКлиенте
Процедура СоздатьОплатуКУ(Команда)
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		Сообщить("Организация!");
		Возврат;
	КонецЕсли;	
	СоздатьОплатуКУНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	//Вставить содержимое обработчика
	Настройки = Справочники.МЛК_Настройки.Выбрать();
	Пока Настройки.Следующий() Цикл
		Если Настройки.НеИспользоватьИнтеграцию Тогда Продолжить; КонецЕсли;
		Объект.Организация = Настройки.Организация;
		Объект.Контрагент  = Настройки.ПлатежныйАгент;
		Прервать;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		ЗаполнитьПлатежки();
	КонецЕсли;
	
	Реестр.Параметры.УстановитьЗначениеПараметра("Платежка", Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка());	
	
	ЗаполнитьРеестрОплат();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Объект.НачалоПериода = ТекущаяДата()-(60*60*24*3);
	Объект.КонецПериода  = ТекущаяДата();
	ПриОткрытииНаСервере();

КонецПроцедуры

&НаСервере
Функция ПолучитьТаблицуПакета(Пакет)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	МЛК_РеестрОплат.ЛицевойСчет КАК ЛицевойСчет,
	|	МЛК_РеестрОплат.Пакет КАК Пакет,
	|	МЛК_РеестрОплат.Дата КАК Дата,
	|	МЛК_РеестрОплат.ДатаЗагрузки КАК ДатаЗагрузки,
	|	МЛК_РеестрОплат.ИД_События КАК ИД_События,
	|	МЛК_РеестрОплат.Сумма КАК Сумма,
	|	МЛК_РеестрОплат.Описание КАК Описание,
	|	МЛК_РеестрОплат.Платежка КАК Платежка,
	|	МЛК_РеестрОплат.ДокОплатыБит КАК ДокОплатыБит
	|ИЗ
	|	РегистрСведений.МЛК_РеестрОплат КАК МЛК_РеестрОплат
	|ГДЕ
	|	МЛК_РеестрОплат.Пакет <> """"
	|	И МЛК_РеестрОплат.Пакет = &Пакет" ;
	Запрос.УстановитьПараметр("Пакет",Пакет);
	Результат = Запрос.Выполнить().Выгрузить();
	Возврат Результат;
КонецФункции	

&НаСервере
Процедура ЗаполнитьРеестрОплат()
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлатежки()
	Объект.ПлатежныеДокументы.Очистить();
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	ПоступлениеНаРасчетныйСчет.Ссылка КАК Ссылка,
	|	ПоступлениеНаРасчетныйСчет.СуммаДокумента КАК СуммаДокумента
	|ИЗ
	|	Документ.ПоступлениеНаРасчетныйСчет КАК ПоступлениеНаРасчетныйСчет
	|ГДЕ
	|	ПоступлениеНаРасчетныйСчет.ПометкаУдаления = ЛОЖЬ
	|	И ПоступлениеНаРасчетныйСчет.Контрагент = &Контрагент
	|	И ПоступлениеНаРасчетныйСчет.Дата >= &Дата1
	|	И ПоступлениеНаРасчетныйСчет.Дата <= &Дата2" ;
	Запрос.УстановитьПараметр("Дата1",НачалоДня(Объект.НачалоПериода));
	Запрос.УстановитьПараметр("Дата2",КонецДня(Объект.КонецПериода));
	Запрос.УстановитьПараметр("Контрагент",Объект.Контрагент);
	Результат = Запрос.Выполнить().Выгрузить();
	Для каждого Выб Из Результат Цикл
		Нов = Объект.ПлатежныеДокументы.Добавить();
		Нов.Сумма                   = Выб.СуммаДокумента;
		Нов.ПоступлениеНаСчет       = Выб.Ссылка;
		Нов.Признак = НайтиСтатус(Выб.Ссылка);
		//Нов.Дата        = Выб.Дата;
	КонецЦикла;		
КонецПроцедуры	

&НаСервере
Функция НайтиСтатус(Платежка)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	|	МЛК_РеестрОплат.ЛицевойСчет КАК ЛицевойСчет,
	|	МЛК_РеестрОплат.Пакет КАК Пакет,
	|	МЛК_РеестрОплат.ИД_События КАК ИД_События,
	|	МЛК_РеестрОплат.ДокОплатыБит КАК ДокОплатыБит,
	|	МЛК_РеестрОплат.ОперацияПоПлатежнойКарте КАК ОперацияПоПлатежнойКарте,
	|	МЛК_РеестрОплат.Платежка КАК Платежка
	|ИЗ
	|	РегистрСведений.МЛК_РеестрОплат КАК МЛК_РеестрОплат
	|ГДЕ
	|	МЛК_РеестрОплат.Платежка = &Платежка";
	Запрос.УстановитьПараметр("Платежка",Платежка);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Если Выборка.Следующий() Тогда
		Если Выборка.ДокОплатыБит.Проведен Тогда
			Возврат "обработан";
		Иначе
			Возврат "не обработан";
		КонецЕсли;
	Иначе
		Возврат "не обработан";
	КонецЕсли;
	
КонецФункции	

&НаКлиенте
Процедура ОбновитьДокументыНаЭкспорт(Команда)
	
	ЗаполнитьПлатежки();	
	ЗаполнитьРеестрОплат();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Объект.НачалоПериода, Объект.КонецПериода);
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора,,,,, ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объект.НачалоПериода = РезультатВыбора.НачалоПериода;
	Объект.КонецПериода  = РезультатВыбора.КонецПериода;
	
	ПриОткрытииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПлатежныеДокументыВыборНаСервере(МассивЗначенийТаблицыБанковскихВыписок)
	БанковскиеВыписки = Новый Массив;
	Для Каждого ЭлементМассива Из МассивЗначенийТаблицыБанковскихВыписок Цикл
		Попытка
			БанковскиеВыписки.Добавить(Объект.ПлатежныеДокументы[ЭлементМассива].ПоступлениеНаСчет);
			//БанковскиеВыписки.Добавить(Объект.ПлатежныеДокументы.НайтиПоИдентификатору(ЭлементМассива).ПоступлениеНаСчет);
		Исключение
			прервать;
		КонецПопытки;
	КонецЦикла;
	
	Реестр.Параметры.УстановитьЗначениеПараметра("Платежка", БанковскиеВыписки);
	
	СуммаПлатежейПоКартам = 0;
	СуммаВыделенныхПоступлений = 0;
	
	Для Каждого ЭлементМассива Из МассивЗначенийТаблицыБанковскихВыписок Цикл
		Попытка
			СуммаВыделенныхПоступлений = СуммаВыделенныхПоступлений + Объект.ПлатежныеДокументы[ЭлементМассива].ПоступлениеНаСчет.СуммаДокумента;
			//СуммаВыделенныхПоступлений = СуммаВыделенныхПоступлений + Объект.ПлатежныеДокументы.НайтиПоИдентификатору(ЭлементМассива).ПоступлениеНаСчет.СуммаДокумента;
		Исключение
			Прервать;
		КонецПопытки;
	КонецЦикла;
	
	ТЗОперацийОплат = ДинамическийСписокВТаблицуЗначений();
	Если ТЗОперацийОплат.Количество()<>0 Тогда
		Для Каждого СтрокаДинамическогоСписка Из ТЗОперацийОплат Цикл
			СуммаПлатежейПоКартам = СуммаПлатежейПоКартам + СтрокаДинамическогоСписка.СуммаДокумента;
		КонецЦикла;
	КонецЕсли;
	
	Настройка = Справочники.МЛК_Настройки.НайтиПоРеквизиту("Организация", Объект.Организация);
	Если Настройка.Комиссия = Перечисления.МЛК_Комиссия.КомиссияСверху Тогда
		Процент = 0;
	Иначе	
		Если СуммаВыделенныхПоступлений<>0 Тогда
			Процент = СуммаПлатежейПоКартам - СуммаВыделенныхПоступлений ;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ДинамическийСписокВТаблицуЗначений()
	
	//Получаем схема компановки данных (здесь хранится текст запроса)
	Схема = Элементы.Реестр.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	
	//Получаем настройки пользователя (отборы, сортировки и т.п.)
	Настройки = Элементы.Реестр.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	
	//Выводим динамический список в таблицу значений
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных();
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки, , ,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	//Возвращаем полученную таблицу значений
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПлатежныеДокументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	МассивСтрок = Элементы.ПлатежныеДокументы.ВыделенныеСтроки;
	//МассивСтрок = ПолучитьМассивСтрок();
	ПлатежныеДокументыВыборНаСервере(МассивСтрок);
КонецПроцедуры

&НаСервере
Функция ПолучитьМассивСтрок()
	Массив = Новый Массив;
	Для Каждого Стр Из Объект.ПлатежныеДокументы Цикл
		Если Стр.Выбран Тогда
			Массив.Добавить(Стр.НомерСтроки-1);

		КонецЕсли;	
	КонецЦикла;
	Возврат Массив;
КонецФункции	

&НаКлиенте
Процедура ПлатежныеДокументыПриАктивизацииСтроки(Элемент)
	МассивСтрок = ПолучитьМассивСтрок();
	
	//Если ЗначениеЗаполнено(Объект.ПлатежныеДокументы) Тогда //Когда раскоменчено то программу выкидывает
	//МассивСтрок = Элементы.ПлатежныеДокументы.ВыделенныеСтроки;
	ПлатежныеДокументыВыборНаСервере(МассивСтрок);
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПровестиДокумент(Команда)
	// Вставить содержимое обработчика.
	ОбработатьДокументыНаСервере();
	ПриОткрытииНаСервере();
	
	//Реестр.Параметры.УстановитьЗначениеПараметра("Платежка", Документы.ПоступлениеНаРасчетныйСчет.ПустаяСсылка());	
КонецПроцедуры

&НаСервере
Процедура ОбработатьДокументыНаСервере()
	
	ТаблицаДляИзмененияСтатуса = Новый ТаблицаЗначений;
	ТаблицаДляИзмененияСтатуса.Колонки.Добавить("ИД_События");
	
	ТаблицаЛС = Новый ТаблицаЗначений;
	ТаблицаЛС.Колонки.Добавить("Ссылка");
	
	ИзменитьСтатус = Ложь;	
	Для Каждого СтрДок Из Объект.ПлатежныеДокументы Цикл
		Если Не СтрДок.ВЫбран Тогда Продолжить; КонецЕсли;
		
		//Запрос в регистр
		
		Запрос = Новый Запрос;
		Запрос.Текст =  "ВЫБРАТЬ
		|	МЛК_РеестрОплат.ЛицевойСчет КАК ЛицевойСчет,
		|	МЛК_РеестрОплат.Пакет КАК Пакет,
		|	МЛК_РеестрОплат.ИД_События КАК ИД_События,
		|	МЛК_РеестрОплат.ДокОплатыБит КАК ДокОплатыБит,
		|	МЛК_РеестрОплат.ОперацияПоПлатежнойКарте КАК ОперацияПоПлатежнойКарте,
		|	МЛК_РеестрОплат.Платежка КАК Платежка
		|ИЗ
		|	РегистрСведений.МЛК_РеестрОплат КАК МЛК_РеестрОплат
		|ГДЕ
		|	МЛК_РеестрОплат.Платежка = &Платежка";
		Запрос.УстановитьПараметр("Платежка",СтрДок.ПоступлениеНаСчет);
		
		ОплатыПоКартам = Запрос.Выполнить().Выгрузить();
		Если ОплатыПоКартам.Количество() <> 0 Тогда
			МассивОплат = ОплатыПоКартам.ВыгрузитьКолонку("ОперацияПоПлатежнойКарте");	
		КонецЕсли;	
		
		
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если ПровелДокумент(Выборка.ДокОплатыБит,МассивОплат) Тогда
				ИзменитьСтатус = Истина;
				НовСтрСтатус = ТаблицаДляИзмененияСтатуса.Добавить();
				НовСтрСтатус.ИД_События   = Выборка.ИД_События;
				
				
				НовСтрСтатус = ТаблицаЛС.Добавить();
				НовСтрСтатус.Ссылка   = Выборка.ЛицевойСчет;
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	
	Если ИзменитьСтатус Тогда
		Настройки = Справочники.МЛК_Настройки.Выбрать();
		Пока Настройки.Следующий() Цикл
			Если Настройки.Организация=Объект.Организация Тогда
				
				ИзменитьСтатусыВСобытиях(ТаблицаДляИзмененияСтатуса,Строка(СтрЗаменить(Настройки.СтатусЗакрыто,Символы.НПП,"")),Настройки);
				ОтправитьВМобстедЛицевойСчет(Настройки,ТаблицаЛС);
				
			КонецЕсли;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	
	
КонецПроцедуры	

&НаСервере
Процедура ИзменитьСтатусыВСобытиях(ТаблицаДляИзмененияСтатуса,КодСтатуса,Настройки)
	
	Для Каждого СТрСтатус Из ТаблицаДляИзмененияСтатуса Цикл
		
		ЕстьОтвет = Истина;
		
		АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
		
		//АдресРесурса1 = "/api/v2/events/"+СТрока(СТрСтатус.ИД_События);
		АдресРесурса1 = "/api/v4/events/"+СТрока(СТрСтатус.ИД_События);
		СтрокаПараметров = "?StatusId="+СТрока(КодСтатуса);
		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1+СтрокаПараметров);
		HTTPЗапрос.УстановитьТелоИзСтроки("", КодировкаТекста.UTF8);
		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
		HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
		HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
		Попытка
			Ответ = HTTPСоединение.Записать(HTTPЗапрос);
		Исключение
			ЕстьОтвет = Ложь;
			Сообщить("Изменение статуса события: "+СТрока(СТрСтатус.ИД_События)+". Ошибка при отправке запроса: " + ОписаниеОшибки());
		КонецПопытки;
		
		Если ЕстьОтвет Тогда
			Если Ответ.КодСостояния = 200 Тогда
				СтрокаОтвет1 = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
				
				//СтрокаОтвет1 = Перевод(СтрокаОтвет1);
				
				СтрокаОтвет1 = "Изменение статуса события. Событие: "+Строка(СТрСтатус.ИД_События)+". "+ СтрокаОтвет1;
				
				
				Сообщить(СтрокаОтвет1);
				Если Не ПустаяСтрока(СтрокаОтвет1) Тогда
					РезультатПроверки1 = СтрокаОтвет1;
					
					Если СокрЛП(РезультатПроверки1)="false" Тогда
						Сообщить("Соединение не установлено");
					Иначе
						
					КонецЕсли;
				КонецЕсли;
			ИначеЕсли Ответ.КодСостояния = 500 Тогда
				Сообщить("Изменение статусов события. "+"Ошибка на сервере. Код ошибки: 500"+". "+Строка(ОписаниеОшибки()));
			ИначеЕсли Ответ.КодСостояния = 404 Тогда
				Сообщить("Изменение статусов события. "+"Неверная ссылка. Код ошибки: 404"+". "+Строка(ОписаниеОшибки()));
			ИначеЕсли Ответ.КодСостояния = 301 Тогда
				Сообщить("Изменение статусов события. "+"Ошибка на сервере. Код ошибки: 301"+". "+Строка(ОписаниеОшибки()));
			Иначе
				Сообщить("Изменение статусов события. "+"Неизвестная ошибка"+". "+Строка(ОписаниеОшибки()));
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры	

&НаСервере
Функция ПолучитьСтруктуруДанныхЛицевогоСчета(ЛицевойСчет,Настройки)
	Структура = Новый Структура("Phone, Email, Имя_Отчество, Город, Улица, Дом, Корпус, Квартира, ApiSumma, Помещение");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПроживающиесяПоЛССрезПоследних.ФизЛицо КАК ФизЛицо,
	|	ПроживающиесяПоЛССрезПоследних.СтатусФизЛица,
	|	ПроживающиесяПоЛССрезПоследних.СтепеньРодства КАК СтепеньРодства,
	|	ПроживающиесяПоЛССрезПоследних.СтатусПроживания,
	|	ПроживающиесяПоЛССрезПоследних.ДатаЗаписи,
	|	ПроживающиесяПоЛССрезПоследних.ДатаРегистрации,
	|	ПроживающиесяПоЛССрезПоследних.ДатаСнятияСРегистрации,
	|	ПроживающиесяПоЛССрезПоследних.ВладелецКвартиры,
	|	ПроживающиесяПоЛССрезПоследних.ДоляПлощади,
	|	ПроживающиесяПоЛССрезПоследних.СтатусФизЛицаДляИзменения
	|ИЗ
	|	РегистрСведений.бит_ПроживающиеПоЛС.СрезПоследних(&Момент, ЛицевойСчет = &ЛицевойСчет) КАК ПроживающиесяПоЛССрезПоследних
	|ГДЕ
	|	(ПроживающиесяПоЛССрезПоследних.ДатаСнятияСРегистрации > &Момент
	|			ИЛИ ПроживающиесяПоЛССрезПоследних.ДатаСнятияСРегистрации = ДАТАВРЕМЯ(1, 1, 1))";
	
	Запрос.УстановитьПараметр("Момент"		, КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ЛицевойСчет"	, ЛицевойСчет.Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Пока Выборка.Следующий() Цикл 
		
		Если Выборка.СтепеньРодства = Справочники.бит_СтепениРодстваФизЛиц.бит_ОтветственноеЛицо Тогда
			ОтветсвенноеЛицо = Выборка.ФизЛицо;
		КонецЕсли; 
		
	КонецЦикла; 
	
	ВладелецЛицевогоСчета = ОтветсвенноеЛицо;
	
	Если Настройки.ПередаватьФамилию Тогда
		//Структура.Имя_Отчество        = ВладелецЛицевогоСчета.Наименование; 
		Структура.Имя_Отчество        = СтрЗаменить(ВладелецЛицевогоСчета.Наименование,"""","\"+"""");
	Иначе
		Попытка
			ИмяОтчество = ФизическиеЛицаКлиентСервер.ЧастиИмени(ВладелецЛицевогоСчета.Наименование);
			Структура.Имя_Отчество        = СтрЗаменить(Строка(ИмяОтчество.Имя)+" "+Строка(ИмяОтчество.Отчество),"""","\"+"""");
		Исключение
			Структура.Имя_Отчество        = "";
		КонецПопытки;
	КонецЕсли;
	
	//Структура.Имя_Отчество = Транслит(Структура.Имя_Отчество);
	Если ЗначениеЗаполнено(ВладелецЛицевогоСчета) Тогда
		Телефон              = бит_ОбщегоНазначения.ПолучитьТелефонИзКонтактнойИнформацииФизЛица(ВладелецЛицевогоСчета);
		Тел = СтрЗаменить(Телефон,"-","");
		Тел = СтрЗаменить(Тел,"+7","7");
		Тел = СтрЗаменить(Тел,"-","");
		Тел = СтрЗаменить(Тел,"(","");
		Тел = СтрЗаменить(Тел,")","");
		Тел = СтрЗаменить(Тел,Символы.НПП,"");
		Тел = СтрЗаменить(сокрлп(Тел)," ","");
		Если Лев(Тел,1)="8" и СтрДлина(Тел)>6 Тогда
			//	Тел = СтрЗаменить(Лев(Тел,1),"8","7");
			тел="7" + Прав(тел,СтрДлина(тел)-1);
		КонецЕсли;
		
		Структура.Phone               = Тел;
		
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КонтактнаяИнформация.Представление
		|ИЗ
		|	РегистрСведений.бит_КонтактнаяИнформация КАК КонтактнаяИнформация
		|ГДЕ
		|	КонтактнаяИнформация.Объект = &Объект
		|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.бит_ТипыКонтактнойИнформации.АдресЭлектроннойПочты)
		|	И КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.бит_ВидыКонтактнойИнформации.EmailПроживающего)";
		
		Запрос.УстановитьПараметр("Объект", ВладелецЛицевогоСчета);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ЭлПочтаПроживающего = "";
		Если Выборка.Следующий() Тогда
			ЭлПочтаПроживающего = Выборка.Представление;
			Структура.Email     = ЭлПочтаПроживающего;
		КонецЕсли;
		Структура.Улица    = ЛицевойСчет.Здание.Улица;
		Структура.Город    = ЛицевойСчет.Здание.Район;
		Структура.Дом      = Строка(ЛицевойСчет.Здание.Улица)+", д. "+ЛицевойСчет.Здание.НомерДома+СТрока(?(ЛицевойСчет.Здание.Корпус="","",", корп. "+Строка(ЛицевойСчет.Здание.Корпус)));
		Структура.Корпус   = ЛицевойСчет.Здание.Корпус;
		Структура.Квартира = ЛицевойСчет.Квартира.Наименование;
		Структура.Помещение = ЛицевойСчет.Здание.ПочтовыйАдрес+", кв. "+Строка(ЛицевойСчет.Квартира.НомерКвартиры);
	Иначе
		Структура.Улица    = ЛицевойСчет.Здание.Улица;
		Структура.Город    = ЛицевойСчет.Здание.Район;
		Структура.Дом      = Строка(ЛицевойСчет.Здание.Улица)+", д. "+ЛицевойСчет.Здание.НомерДома+СТрока(?(ЛицевойСчет.Здание.Корпус="","",", корп. "+Строка(ЛицевойСчет.Здание.Корпус)));
		Структура.Корпус   = ЛицевойСчет.Здание.Корпус;
		Структура.Квартира = ЛицевойСчет.Квартира.Наименование;
		Структура.Помещение = ЛицевойСчет.Здание.ПочтовыйАдрес+", кв. "+Строка(ЛицевойСчет.Квартира.НомерКвартиры);
	КонецЕсли;
	//Структура.Улица    = Транслит(ЛицевойСчет.Здание.Улица);
	//Структура.Город    = Транслит(ЛицевойСчет.Здание.Район);
	//Структура.Дом      = ЛицевойСчет.Здание.НомерДома;
	//Структура.Корпус   = ЛицевойСчет.Здание.Корпус;
	//Структура.Квартира = ЛицевойСчет.Квартира.Наименование;
	
	
	//Долг + текущие начисления
	
	ДолгПоЛС = ВывестиСуммуДолгаПоЛС(ЛицевойСчет,Настройки);
	Долг     = ДолгПоЛС.СтрокаДолга;
	Структура.ApiSumma = Долг;
	
	Возврат Структура;
	
КонецФункции

&НаСервере
Процедура ОтправитьВМобстедЛицевойСчет(Настройки,ТаблицаЛС)
	
	МЛК_Общий.ОтправитьВСистемуМЛКЛицевойСчет(Настройки, ТаблицаЛС, Ложь);
	////Журнал
	//ЖурналЗапросБезКодировки   = "";
	//ЖурналСтрокаОписанияОшибки = "";
	//ЖурналВремяНачало          = ТекущаяДата();
	//ЖурналЗапросБезКодировкиМассив = Новый Массив;
	////Журнал
	//
	//СтрокаПараметров = "";
	//Счетчик = 0;
	//АдресСервисаСтр = СокрЛП(Настройки.АдресКабинетов);
	//АдресРесурса1 = "/api/v6/objects/createupdate";
	//
	////Журнал
	//ЖурналЗапросБезКодировкиМассив.Добавить(Строка(АдресСервисаСтр)+Строка(АдресРесурса1));				
	//
	//Для Каждого Выборка Из ТаблицаЛС Цикл
	//	
	//	Если Счетчик = 100 Тогда
	//		
	//		HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
	//		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
	//		HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
	//		HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
	//		HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	//		Попытка
	//			Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	//		Исключение
	//			Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
	//		КонецПопытки;
	//		
	//		Если Ответ.КодСостояния = 200 Тогда
	//			СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	//			
	//			Если Не ПустаяСтрока(СтрокаОтвет) Тогда
	//				РезультатПроверки = СтрокаОтвет;
	//				Результат = РезультатПроверки;
	//				Сообщить(Результат);
	//			КонецЕсли;
	//		Иначе
	//			ЖурналСтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
	//			//Журнал
	//			ИмяСобытияВЖурнал = "Отправка всех лицевых счетов в МЛК";
	//			КодСостояния = Ответ.КодСостояния;
	//			СтрокаОтвета = СтрокаОтвет;	
	//			МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировки,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало,ТекущаяДата());	
	//		КонецЕсли;
	//		Счетчик = 0;
	//		Запрос1 = "";
	//		Запрос2 = "";
	//		ЖурналЗапросБезКодировки = "";
	//		СтрокаПараметров = "";
	//		
	//		Продолжить;
	//	КонецЕсли;	
	//	
	//	Структура = ПолучитьСтруктуруДанныхЛицевогоСчета(Выборка.ЛицевойСчет.Ссылка,Настройки);
	//	ТекущаяСтрока = Структура;
	//	Запрос1 = "{"+"""ApplicationId"""+":"++Строка(СокрЛП(Настройки.НомерПриложения))+","+"""НомерЛицевогоСчета"""+":"+""""+Строка(Выборка.ЛицевойСчет.Ссылка.Наименование)+""""+"}";
	//	Запрос2 = "{"+
	//	"""Код1С"""   +":"+""""+Строка(Выборка.ЛицевойСчет.Ссылка.Код)+""""+","+
	//	"""Наименование"""   +":"+""""+Строка(ТекущаяСтрока.Имя_Отчество)+""""+","+
	//	//"""Микрорайон"""   +":"+""""+Строка(ТекущаяСтрока.Микрорайон)+""""+","+
	//	"""НомерЛицевогоСчета"""+":"+""""+Строка(Выборка.ЛицевойСчет.Ссылка.Наименование)+""""+","+
	//	"""ЛС"""+":"+""""+Строка(Выборка.ЛицевойСчет.Ссылка.Наименование)+""""+","+
	//	"""Помещение"""   +":"+""""+Строка(ТекущаяСтрока.Помещение)+""""+","+
	//	//"""Здание"""     +":"+""""+Строка(ТекущаяСтрока.Здание)+""""+","+
	//	"""НомерКвартиры"""  +":"+""""+Строка(ТекущаяСтрока.Квартира)+""""+","+
	//	"""Phone"""   +":"+""""+Строка(ТекущаяСтрока.Phone)+""""+","+
	//	"""Enabled"""   +":"+""""+Строка(1)+""""+","+
	//	"""ApiSumma"""   +":"+""""+Формат(ТекущаяСтрока.ApiSumma,"ЧРД=.; ЧГ=0; ЧДЦ=2")+""""+","+    
	//	"""ApiDate"""   +":"+""""+Формат(ТекущаяДата(),"ДЛФ=Д")+""""+","+
	//	"""Email"""+":"+""""+Строка(ТекущаяСтрока.Email)+""""+"}";
	//	
	//	////Журнал       !!!!!СИЛЬНО ГРУЗИТ - ОСНОВНОЕ ВРЕМЯ УХОДИТ НА ЭТО
	//	Если СтрокаПараметров = "" Тогда
	//		ЖурналЗапросБезКодировкиМассив.Добавить("create"+Счетчик+"="+Запрос1+"&update"+Счетчик+"="+Запрос2);
	//	Иначе
	//		ЖурналЗапросБезКодировкиМассив.Добавить("&create"+Формат(Счетчик,"ЧГ=")+"="+Запрос1+"&update"+Формат(Счетчик,"ЧГ=")+"="+Запрос2);
	//	КонецЕсли;
	//	
	//	Запрос1 = КодироватьСтроку(Запрос1,СпособКодированияСтроки.КодировкаURL);
	//	Запрос2 = КодироватьСтроку(Запрос2,СпособКодированияСтроки.КодировкаURL);
	//	
	//	Если СтрокаПараметров = "" Тогда
	//		СтрокаПараметров = "create"+Счетчик+"="+Запрос1+"&update"+Счетчик+"="+Запрос2;
	//	Иначе
	//		СтрокаПараметров = СтрокаПараметров+"&create"+Формат(Счетчик,"ЧГ=")+"="+Запрос1+"&update"+Формат(Счетчик,"ЧГ=")+"="+Запрос2;
	//	КонецЕсли;
	//	
	//	Счетчик=Счетчик+1;	
	//КонецЦикла;
	//
	//
	//HTTPЗапрос = Новый HTTPЗапрос(АдресРесурса1);
	//HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаПараметров, КодировкаТекста.UTF8);
	//HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/x-www-form-urlencoded; charset=UTF-8");   // тут поменялось
	//HTTPЗапрос.Заголовки.Вставить("Authorization", "Basic "+Строка(Настройки.Токен));
	//HTTPСоединение = Новый HTTPСоединение(АдресСервисаСтр, , , , , ,Новый ЗащищенноеСоединениеOpenSSL);
	//Попытка
	//	Ответ = HTTPСоединение.ОтправитьДляОбработки(HTTPЗапрос);
	//Исключение
	//	Сообщить("Ошибка при отправке запроса: " + ОписаниеОшибки());
	//КонецПопытки;
	//
	//Если Ответ.КодСостояния = 200 Тогда
	//	СтрокаОтвет = Ответ.ПолучитьТелоКакСтроку(КодировкаТекста.UTF8);
	//	
	//	Если Не ПустаяСтрока(СтрокаОтвет) Тогда
	//		РезультатПроверки = СтрокаОтвет;
	//		Результат = РезультатПроверки;
	//		Сообщить(Результат);
	//	КонецЕсли;
	//Иначе
	//	ЖурналСтрокаОписанияОшибки = Строка(ОписаниеОшибки()); 
	//КонецЕсли;
	//////Журнал
	////ИмяСобытияВЖурнал = "Отправка всех лицевых счетов в МЛК";
	////КодСостояния = Ответ.КодСостояния;
	////СтрокаОтвета = СтрокаОтвет;	
	////МЛК_Общий.ЗаписатьДанныеВЖурнал(ИмяСобытияВЖурнал,КодСостояния,ЖурналЗапросБезКодировкиМассив,СтрокаОтвета,ЖурналСтрокаОписанияОшибки,ЖурналВремяНачало,ТекущаяДата());	
	//
	//Если КодСостояния = 200 Тогда
	//	Об = Настройки.ПолучитьОбъект();
	//	Об.ДатаПоследнейСинхронизацииПоЛицевымСчетам = ТекущаяДата();
	//	Об.Записать();
	//КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуДолга(Организация, Дата)
	//Взята из конфигурации, получает дату долга
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	НАЧАЛОПЕРИОДА(ДОБАВИТЬКДАТЕ(&Дата, МЕСЯЦ, -(ВЫБОР
	|				КОГДА ДЕНЬ(&Дата) > бит_НастройкаПараметровЖКХСрезПоследних.ПоследнийДеньПриемаПлатежей
	|					ТОГДА 0
	|				ИНАЧЕ 1
	|			КОНЕЦ + бит_НастройкаПараметровЖКХСрезПоследних.КоличествоМесяцевОтсрочкиНачисленияПени)), МЕСЯЦ) КАК Дата
	|ИЗ
	|	РегистрСведений.бит_НастройкаПараметровЖКХ.СрезПоследних(&Дата, Организация = &Организация) КАК бит_НастройкаПараметровЖКХСрезПоследних";
	
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Дата"       , Дата);
	
	Возврат ?(Запрос.Выполнить().Пустой(), ТекущаяДата(),Запрос.Выполнить().Выгрузить()[0].Дата);
	
КонецФункции // ()

&НаСервере
Функция ВывестиСуммуДолгаПоЛС(ЛицевойСчет,Настройки)
	
	ДатаДолга = ПолучитьДатуДолга(Настройки.Организация, ТекущаяДата());
	
	// Определим сумму долга по начислениям для текущего лицевого счета.
	ЗапросПоНачислениям = Новый Запрос;
	ЗапросПоНачислениям.УстановитьПараметр("КонецПериода", КонецДня(ТекущаяДата()));
	ЗапросПоНачислениям.УстановитьПараметр("ЛицевойСчет" , ЛицевойСчет.Ссылка);
	ЗапросПоНачислениям.УстановитьПараметр("ДатаДолга"   , ДатаДолга);
	ЗапросПоНачислениям.Текст = 
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0) < 0
	|			ТОГДА 0
	|		ИНАЧЕ ЕСТЬNULL(Долг.СуммаОстаток, 0) + ЕСТЬNULL(ОплатаСДатыДолга.Разовые, 0) - ЕСТЬNULL(ОплатаСДатыДолга.Оплата, 0)
	|	КОНЕЦ КАК Долг
	|ИЗ
	|	(ВЫБРАТЬ
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет КАК ЛицевойСчет,
	|		СУММА(бит_НачисленияПоУслугамЖКХОстатки.СуммаОстаток) КАК СуммаОстаток
	|	ИЗ
	|		РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Остатки(&ДатаДолга {(&ДатаДолга)}, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОстатки
	|	
	|	СГРУППИРОВАТЬ ПО
	|		бит_НачисленияПоУслугамЖКХОстатки.ЛицевойСчет) КАК Долг
	|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет КАК ЛицевойСчет,
	|			СУММА(ВЫБОР
	|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_ОплатаКУ
	|						ТОГДА -бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|				КОНЕЦ) КАК Оплата,
	|			СУММА(ВЫБОР
	|					КОГДА бит_НачисленияПоУслугамЖКХОбороты.Регистратор ССЫЛКА Документ.бит_РазовыеПоУслугамЖКХ
	|						ТОГДА бит_НачисленияПоУслугамЖКХОбороты.СуммаОборот
	|				КОНЕЦ) КАК Разовые
	|		ИЗ
	|			РегистрНакопления.бит_НачисленияПоУслугамЖКХ.Обороты(НАЧАЛОПЕРИОДА(&ДатаДолга, МЕСЯЦ) {(&ДатаДолга)}, &КонецПериода {(&КонецПериода)}, Регистратор, ЛицевойСчет = &ЛицевойСчет) КАК бит_НачисленияПоУслугамЖКХОбороты
	|		
	|		СГРУППИРОВАТЬ ПО
	|			бит_НачисленияПоУслугамЖКХОбороты.ЛицевойСчет) КАК ОплатаСДатыДолга
	|		ПО Долг.ЛицевойСчет = ОплатаСДатыДолга.ЛицевойСчет";
	
	тмпДолг = 0;
	
	Выборка = ЗапросПоНачислениям.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		тмпДолг = Выборка.Долг;
	КонецЕсли;
	
	Если тмпДолг > 0 Тогда
		ИнфСтрока = Строка(тмпДолг);
		ЦветНадписи = Новый Цвет(255, 0, 0); // Красный.
		
	Иначе
		ИнфСтрока = "0";
		ЦветНадписи = Новый Цвет(0, 0, 0);
	КонецЕсли;
	
	СтруктураВозврата = Новый Структура;
	СтруктураВозврата.Вставить("СтрокаДолга", ИнфСтрока);
	СтруктураВозврата.Вставить("ЦветНадписи", ЦветНадписи);
	
	Возврат СтруктураВозврата;
	
КонецФункции  //ВывестиСуммуДолгаПоЛС()

&НаСервере
Функция ПровелДокумент(ДокОплаты,МассивОплат)
	Если ДокОплаты.Проведен Тогда
		
		//Проверим Полаты по картам
		Для Каждого Док Из МассивОплат Цикл
			Если Не Док.проведен Тогда
				ОбъектДокОплатыКартой = Док.ПолучитьОбъект();
				ОбъектДокОплатыКартой.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
			КонецЕсли;	
		КонецЦикла;
		Возврат Истина;
	КонецЕсли;
	ОбъектДокОплаты = ДокОплаты.ПолучитьОбъект();
	ОбъектДокОплаты.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
	Для Каждого Док Из МассивОплат Цикл
		Если Не Док.проведен Тогда
			ОбъектДокОплатыКартой = Док.ПолучитьОбъект();
			ОбъектДокОплатыКартой.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Неоперативный);
		КонецЕсли;	
	КонецЦикла;
	Возврат Истина;
	
КонецФункции	

&НаСервере
Процедура ПлатежныеДокументыВыбранПриИзмененииНаСервере()
	МассивСтрок = ПолучитьМассивСтрок();
	
	//Если ЗначениеЗаполнено(Объект.ПлатежныеДокументы) Тогда //Когда раскоменчено то программу выкидывает
	//МассивСтрок = Элементы.ПлатежныеДокументы.ВыделенныеСтроки;
	ПлатежныеДокументыВыборНаСервере(МассивСтрок);
	//КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлатежныеДокументыВыбранПриИзменении(Элемент)
	ПлатежныеДокументыВыбранПриИзмененииНаСервере();
КонецПроцедуры
